lorcan35/TinkerTab/sdkconfig.defaults
# TinkerClaw Tab5 — ESP32-P4 defaults (Phase 1.5)
# Matched to M5Stack Tab5 BSP sdkconfig

# Target
CONFIG_IDF_TARGET="esp32p4"

# Flash — Tab5 has 16MB QIO flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Compiler — performance optimized
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# PSRAM — 200MHz, XIP enabled (critical for MIPI DSI framebuffer DMA)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# L2 Cache — 256KB with 128-byte lines (needed for DSI video streaming)
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Larger main task stack (display init needs room)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# USB console (JTAG/serial)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Experimental features (required for some MIPI DSI APIs)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ---------------------------------------------------------------------------
# ESP-Hosted — WiFi via ESP32-C6 co-processor over SDIO
# ---------------------------------------------------------------------------
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# SDIO bus — 4-bit mode, 40MHz
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000

# SDIO GPIO pins (P4 → C6)
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PIN_D1=10
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8

# C6 reset via GPIO 15 (active-low)
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_RESET_GPIO_ACTIVE_LOW=y

# SDIO optimization
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=20
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=20
CONFIG_ESP_HOSTED_USE_MEMPOOL=y

# WiFi Remote (bridges esp_wifi API to C6)
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# ---------------------------------------------------------------------------
# WiFi credentials and Dragon server (overridable via menuconfig)
# ---------------------------------------------------------------------------
CONFIG_TAB5_WIFI_SSID="Sawaya-2.4G"
CONFIG_TAB5_WIFI_PASS="Jx3dzz8t///"
CONFIG_TAB5_DRAGON_HOST="192.168.1.89"
CONFIG_TAB5_DRAGON_PORT=3501

# ---------------------------------------------------------------------------
# LVGL Configuration
# ---------------------------------------------------------------------------
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_THEME_DEFAULT_DARK=y
